corona-care/app/serializers/user_serializer.rb

SELECT "convos".* FROM "convos" INNER JOIN "messages" ON "convos"."id" = "messages"."convo_id" WHERE "messages"."user_id" = $1  [["user_id", 3]]
---
  def conversations
    self.object.convos.map do |convo|

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 3]]
---
  def messages
    self.object.messages.map do |message|