corona-care/app/controllers/application_controller.rb

    def current_user
        if decoded_token
            user_id = decoded_token[0]['user_id']
            @current_user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]