corona-care/app/controllers/convos_controller.rb

    def create
        @convo = Convo.create([convo_params])
---
INSERT INTO "convos" ("fromID", "toID", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fromID", 3], ["toID", 2], ["created_at", "2020-04-09 05:45:40.212440"], ["updated_at", "2020-04-09 05:45:40.212440"]]