corona-care/app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "convo_id", "messagetext", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["convo_id", 23], ["messagetext", "dfsdfsf"], ["created_at", "2020-04-09 06:14:18.556365"], ["updated_at", "2020-04-09 06:14:18.556365"]]
---
    def create
        @message = Message.create([message_params])