corona-care/app/controllers/requests_controller.rb

    def index
        puts "hit index in requests controller"
        @requests = Request.all
---
SELECT "requests".* FROM "requests"

    def create
        @request = Request.create([request_params])
---
INSERT INTO "requests" ("user_ID", "title", "description", "category", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_ID", 3], ["title", "1"], ["description", "1"], ["category", ""], ["location", "1"], ["created_at", "2020-04-10 07:49:11.714046"], ["updated_at", "2020-04-10 07:49:11.714046"]]