corona-care/app/controllers/users_controller.rb

    def create
        # @user = User.create
        # (user_params)
        # i DO NOT KNOW why this isnt' working. workaround: strong params

        @user = User.create(firstName: params[:firstName], lastName: params[:lastName], city: params[:city], phone: params[:phone], username: params[:username], password: params[:password])
---
INSERT INTO "users" ("firstName", "lastName", "phone", "username", "city", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"